{
    "companies" : [
        {
            "name" : "Adobe",
            "role": "Application Security Engineer",
            "imageUrl" : "/companies/adobe_logo.jpeg",
            "description" : "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.", 
            "requirements" : "Bachelor's Degree or 4+ years of equivalent experience in the Computer Science, Engineering or Application Security field. 2+ years of demonstrated ability using Python, C, C++, or Java. Strong technical skills in areas like threat modeling, secure design, vulnerability management, and security testing. Demonstrated ability to evaluate the security of a system. Knowledge of building resilient, highly available systems. Ability to solve problems using appropriate tools and techniques across the full stack",
            "prefered" : "Ambitious and results-oriented, with excellent interpersonal and communication skills. Someone who cares deeply about customers including our internal developers",
            "jobId": "LE96003"
        },
        {
            "name" : "Amazon",
            "role" : "Software Development Engineer",
            "imageUrl" : "/companies/amazon_logo.jpeg",
            "description" : "Amazon Freight (www.freight.amazon.com) is building the technology that enables shippers to ship their own freight using the same capabilities Amazon uses to reliably deliver millions of packages every day to its customers – on time, with low cost. If you are looking for an opportunity to solve technical problems, build innovative solutions, work with top notch software developers, delight our shippers, and help build a Billion dollar business - this might be the role for you.", 
            "requirements" : " 3+ years of non-internship professional software development experience. 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience. Experience programming with at least one software programming language', prefered:'3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience.Bachelor's degree in computer science or equivalent.",
            "prefered" : "3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience.Bachelor's degree in computer science or equivalent.",
            "jobId": "PA90002"
        },
        {
            "name" : "American Express",
            "role": "UX Designer",
            "imageUrl" : "/companies/Amex_logo.jpeg",
            "description" : "With the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities, and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.", 
            "requirements" : "Computer Science, or equivalent degree, or industry experience. Minimum 4 years software development experience in a professional work environment working with Java technologies and concepts (Vertx, Spring, Spring Boot, Dropwizard, RESTful micro services, Camel, Reactive programming, Functional programming). Hands-on work experience with application design, software development and automated testing.Experience with distributed (multi-tiered) systems, algorithms, relational (Oracle etc) and NoSQL databases (Couchbase etc). Knowledge of streaming services like Kafka is a plus. Ability to effectively interpret technical and business objectives and challenges and eloquent solutions. Ability to learn and investigate new technology and business domains, question status quo and think outside of the box. Ability to debug basic software components and identify code defects for remediation. Experience working in Agile or other rapid application development methods. Proficient oral and written communication skills.",
            "prefered" : "Function as member of an agile team by contributing to software builds through consistent development practices (tools, common components, and documentation). Participate in code reviews and automated testing. Debug basic software components and identify code defects for remediation. Support, and monitoring of software across test, integration, and production environments. Automate deployments in test or production environments. Automatically scale applications based on demand projections.",
            "jobId": "AM98012"
                
        },
        {
            "name" : "Dice",
            "role": "Jira Developer",
            "imageUrl" : "/companies/dice_logo.jpeg",
            "description" : "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Stellar Professionals LLC, is seeking the following. Apply via Dice today!", 
            "requirements" : "Bachelor's Degree or an equivalent combination of education and experience. Familiarity with Git and branching models or other source control repositories. Basic query language experience (SQL or equivalent, JQL a bonus). Programming experience with a willingness to learn. Knowledge and understanding of the software development cycle.",
            "prefered" : "HTML.Java.Programming.Query Languages.Software Development.",
            "jobId": "HA96012"
        },
        {
            "name" : "J Crew",
            "role": "Software Engineer",
            "description" : "We make timeless clothes that last a lifetime…then pair them with of-the-moment styles season after season, decade after decade. We think that distinct heritage pairs perfectly with modern design and fabric technology. We believe in feel-good color.", 
            "requirements" : "Bachelor’s Degree in Computer Science, MIS or related field, or equivalent experience in a technology-related field. 5 + years of software engineer/developer or other technical position experience which includes implementing supply chain solutions. 3+ years of experience in Technical Consulting, problem definition, Architecture, Design, and configuration. 3+ years of WMS project implementation experience, integration with other process areas, and enterprise software(s). Experience driving dashboards and reporting solutions.",
            "prefered" : "Have Manhattan WMS experience. Have Supply Chain experience in Retail and/or Ecommerce Fulfillment",
            "jobId": "HJ92412"
        },
        {
            "name" : "Snowflake",
            "role": "Salesforce Developer",
            "description" : "Snowflake started with a clear vision: develop a cloud data platform that is effective, affordable, and accessible to all data users. Snowflake developed an innovative new product with a built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. We are now a global, world-class organization with offices in more than a dozen countries and serving many more.", 
            "requirements" : "Bachelor's degree required in Computer Science, Software Engineering, Technology, or in a related field. 2 - 5+ years of Experience in developing solutions using Salesforce Platform. Proven experience in Salesforce development and customization. Familiarity with CLM systems and contract management processes (CLM systems like Conga, Ironclad, DocuSign, etc). Strong knowledge of Apex, Visualforce, Lightning components, and Salesforce APIs. Understanding of the of the Salesforce Platform and how it integrates with CLM. Experience with integration tools and middleware. Strong problem-solving skills and attention to detail. Excellent communication and teamwork skills. Good interpersonal skills and a strong sense of ownership. Excellent spoken and written communication skills with ability to present complex ideas in a clear, concise fashion to technical and non-technical audiences",
            "prefered" : "Design and develop custom Salesforce solutions, including Apex classes, triggers, Lightning components, Visualforce pages, and integrations. You are energized when new features and technologies become available and eager to understand them and maximize their potential",
            "jobId": "YS92412"
        },
        {
            "name" : "Digital Ignite",
            "role": "Web Developer",
            "description" : "Digital Ignite is a full-service digital marketing agency based in Charleston, South Carolina Metropolitan Area. We use radical data-informed strategies to grow businesses and ignite sales. Our team has honed a strategic approach to digital marketing over several years. We begin each project with the desired outcome and draw upon our proprietary tool kit of data-informed solutions including artificial intelligence, machine learning, and data analysis. We constantly test, evolve, and refine our methods, delivering extraordinary results for our clients and their bottom line.", 
            "requirements" : "Proficient in HTML, CSS, JavaScript, PHP, and Shopify Liquid. Strong experience in MySQL and API integration. Advanced CMS experience in Shopify and WordPress. Experience integrating Advanced Custom Fields on the WordPress platform. Experience working with the block editor on the WordPress platform. Knowledge of coding best practices including maintaining code repositories and setting up testing/staging environments. Knowledge of common web programming languages such as Ruby, Rust, Python, or Node.",
            "prefered" : "eCommerce website experience is strongly preferred. We’re looking for someone with at least 5 years of experience working with Shopify and/or WordPress/WooCommerce - specifically creating, customizing, and managing custom website themes.",
            "jobId": "PX97912"
        },
        {
            "name" : "Aruba",
            "role": "Cloud Software Engineer",
            "description" : "Aruba Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here.", 
            "requirements" : "Bachelor's or Master's degree in Computer Science, Information Systems, or equivalent. Typically 4-6 years experience",
            "prefered" : "You have a good understanding of Networking Technologies, various networking protocols, L2, L3 concepts. You have a good understanding of Cloud Security concepts and have working knowledge in Security related protocol. You have experience in creating modern cloud-based config and telemetry solutions.",
            "jobId": "QW97312"
        },
        {
            "name" : "KPMG",
            "role": "AI Lead Engineer",
            "description" : "Known for being a great place to work and build a career, KPMG provides audit, tax and advisory services for organizations in today’s most important industries. Our growth is driven by delivering real results for our clients. It’s also enabled by our culture, which encourages individual development, embraces an inclusive environment, rewards innovative excellence and supports our communities.", 
            "requirements" : "Minimum five years of recent experience in a DAP implementation or professional services experience focused on user adoption. Bachelor's degree from an accredited college or university is preferred . Knowledge of generative AI principles and AI prompt management; intermediate understanding of web design and UX principles; HTML, CSS, and/or JavaScript (jQuery) experience is a strong advantage. Ability to understand technical possibilities and limitations of DAP and be able to explain technical concepts to non-technical audiences; experience working in a deadline-driven environment and multitask/prioritize a workload of competing priorities.",
            "prefered" : "WalkMe experience is preferred, although experience with other DAP providers such as Whatfix, Pendo, Toonimo, UserLane, and more will be considered. Experience collaborating cross-functionally to create alignment and support; ability to independently manage several projects simultaneously and operate under tight deadlines; background in organizational change management, copywriting, and learning and development is a plus",
            "jobId": "FS87212"
        },
        {
            "name" : "Deloitte",
            "role": "Front End Developer",
            "description" : "In this age of disruption, organizations need to navigate the future with confidence by tapping into the power of data analytics, robotics, and cognitive technologies such as Artificial Intelligence (AI). Our Strategy & Analytics portfolio helps clients leverage rigorous analytical capabilities and a pragmatic mindset to solve the most complex of problems. By joining our team, you will play a key role in helping to our clients uncover hidden relationships from vast troves of data and transforming the Government and Public Services marketplace.", 
            "requirements" : "Bachelor's degree required. Must be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future. Must be able to obtain and maintain the required US Security clearance for this role. Travel up to 10%. 2+ years of professional experience with React and TypeScript.  1+ years hands on experience in configuring front-end build tools (Webpack, Rollup, Vite, etc.). 1+ years hands on experience working with RESTful APIs and collaborating with a back-end (Java) development team.",
            "prefered" : "Basic knowledge of visualization libraries (E-charts, Vega, D3) is a plus. Excellent problem-solving/analytical skills and ability to break down large complex concepts. Knowledgeable about engineering best practices (testing, reviews, and design documentation) and web standards",
            "jobId": "CJ89212"
        }
    ]
}